Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/bankaccounts.po
Languages: fr

source: Bank accounts
fr: Compte bancaires

source: The first thing you should do for the first time is to create a new bank account. After being logged in, you should be on the page ``/bank-account/``. You could see *actions links* on the top right corner. Click on *Add*.
fr: La première chose que vous devez faire est de créer un compte bancaire. Après s'être authentifié, vous devriez être sur la page ``/bank-account/``. Vous pouvez voir les *liens d'actions* en haut à droite. Cliquez sur *Ajouter*.

source: Once created, you should see it in the list. Click on it. You should go to the bank account overview page. From this page, you could navigate to:
fr: Une fois crée, vous devriez le voir dans la liste. Cliquez dessus. Vous serez dirigé sur la page d'aperçu du compte bancaire. À partir de cette page, vous pouvez :

source: edit the bank account
fr: éditer le compte bancaire

source: delete the bank account (through *action links*)
fr: supprimer le compte bancaire (via les *liens d'actions*)

source: schedule bank transactions of this bank account
fr: planifier des transactions bancaires pour ce compte bancaire

source: see statistics of this bank account
fr: voir les statistiques de ce compte bancaire

source: add bank transactions for that bank account
fr: ajouter des transactions bancaires pour ce compte bancaire

source: filter results with a form
fr: filtrer les résultats avec un formulaire

source: apply some actions on bank transactions
fr: appliquer certaines actions sur les transactions bancaires

source: If you have **only one** bank account, you will be redirected to its page after being logged in. Otherwise, you will be redirected on the bank accounts list page at ``/bank-account/``.
fr: Si vous avez seulement *un* compte bancaire, vous serez redirigé sur sa page après vous être authentifié. Sinon, vous serez redirigé sur la page qui liste les comptes bancaires à ``/bank-account/``.
