Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/banktransactions.po
Languages: fr

source: Bank transactions
fr: Transactions bancaires

source: Once bank accounts, tags, and schedulers are created, you could now begin to create other bank transactions. You can manage bank transactions from the related bank account page overview:
fr: Une fois les comptes bancaires, étiquettes et planificateurs crées, vous pouvez désormais commencer à créer des transactions bancaires. Vous pouvez gérer les transactions bancaires à partir de la page d'aperçu du compte bancaire :

source: add
fr: ajouter

source: edit
fr: éditer

source: delete
fr: supprimer

source: On the bank account page, you can filter bank transactions. But also apply some actions in bulk by checking the corresponding boxes:
fr: Sur la page du compte bancaire, vous pouvez filtrer les transactions bancaires. Mais aussi appliquer certaines actions en masse en cochant les cases adéquates :

source: reconciled selected bank transactions
fr: pointer les transactions bancaires sélectionnées

source: unreconciled selected bank transactions
fr: dépointer les transactions bancaires sélectionnées

source: Bank transactions alter the bank account balance when they are:
fr: Les transactions bancaires modifient le solde du compte bancaire quand elles sont :

source: created
fr: crées

source: updated
fr: modifiées

source: deleted
fr: supprimées

source: If you don't want to apply these alterations, you may set the bank transaction's status to *inactive*. See :ref:`banktransactions-fields-status`.
fr: Si vous ne voulez pas appliquer ces modifications, vous pouvez mettre le statut de la transaction bancaire à *inactive*. Voir :ref:`banktransactions-fields-status`.

source: Fields
fr: Champs

source: Some fields need more explanations:
fr: Certains champs nécessitent plus d'explications :

source: Status
fr: Statut

source: Each statuses may have the following actions:
fr: Chaques statuts peuvent appliquer les actions suivantes :

source: Alter balance
fr: Modifier le solde

source: Statistics
fr: Statistiques

source: active
fr: actif

source: Yes
fr: Oui

source: ignored
fr: ignoré

source: No
fr: Non

source: inactive
fr: inactif

source: Indeed, bank transactions could:
fr: En effet, les transactions bancaires peuvent :

source: alter the bank account balance. Thus, they are used for the total of the balance (future, current, reconciled)
fr: modifier le solde du compte bancaire. Par conséquent, elles sont comptabilisées dans le total du solde (futur, courant, pointé)

source: being used for statistics (ratio and trendtime)
fr: être utilisées pour les statistiques (proportionnelle ou chronologique)

source: *Active* is the default status. *Ignored* could be used for internal transfer for example. You may need it if you want to alter the bank account balance but don't want to pollute your statistics with. *Inactive* exists for purpose only. I didn't find any use cases for it now. May be changed/removed in the future.
fr: *Actif* est le statut par défaut. *Ignoré* peut être utilisé pour des virements internes par exemple. Vous pouvez en avoir besoin si vous voulez modifier le solde bancaire mais ne voulez pas polluer les statistiques. *Inactif* existe juste par principe, je n'ai pas trouvé de cas d'utilisation pour le moment. Cela peut changer à l'avenir (voir supprimer).

source: Reconcile flag
fr: Drapeau pointé

source: This is a marker which indicates whether it is synchronous with your real bank account. It is usefull to anticipate expenses for example. You can see a quick summary of the reconciled balance as well as the total reconciled balance. On the contrary, you can also see the balance from a given bank transaction or the future total balance.
fr: C'est un pointeur qui indique si c'est synchronisé avec votre vrai compte bancaire. C'est utile par exemple pour anticiper vos dépenses. Vous pouvez voir un bref résumé du solde pointé tout comme le solde total pointé. Au contraire, vous pouvez aussi voir le solde à partir d'une transaction bancaire ou le solde total futur.
