Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: fr

source: Requirements
fr: Prérequis

source: Python 3.4 (no backward compatibility)
fr: Python 3.4 (pas de compabitilité descendante)

source: PostgreSQL **only** (no MySQL or SQLite support)
fr: PostgreSQL **uniquement** (pas de support MySQL ou SQLite)

source: Deployment
fr: Déploiement

source: The deployment is the same as any other Django projects. Here is a quick summary:
fr: Le déploiement est similaire à d'autres projets Django. Voici un bref résumé :

source: install required system packages. For example on Debian::
fr: installer les paquets systèmes requis. Par exemple sur Debian::

source: create a PostgreSQL database in a cluster with role and owner
fr: créer un cluster de base de données pour PostgreSQL ainsi qu'un rôle et un propriétaire

source: create a virtualenv::
fr: créer un virtualenv::

source: install dependencies with pip (see :ref:`installation-backend-production` or :ref:`installation-backend-development`)
fr: installer les dépendances avec pip (voir :ref:`installation-backend-production` ou :ref:`installation-backend-development`)

source: configure the settings (see :ref:`installation-backend-production` or :ref:`installation-backend-development`)
fr: configurer les paramètres ( voir :ref:`installation-backend-production` ou :ref:`installation-backend-development`)

source: export the ``DJANGO_SETTINGS_MODULE`` to easily use the ``manage.py`` with the proper production setting. For example::
fr: exporter la variable d'environnement ``DJANGO_SETTINGS_MODULE`` pour facilement utiliser ``manage.py`` avec les paramètres de production. Par exemple::

source: import the SQL schema::
fr: importer le schéma SQL::

source: create a super user::
fr: créer un super utilisateur::

source: WSGI will use the ``production.py`` settings, whereas ``manage.py`` will use the ``local.py`` by default.
fr: WSGI utilisera les paramètres ``production.py`` alors que ``manage.py`` utilisera ``local.py`` par défaut.

source: Install dependencies (in virtualenv)::
fr: Installer les dépendances (dans un virtualenv)::

source: copy ``mymoney/settings/production.dist`` to ``mymoney/settings/production.py`` and edit it::
fr: copier ``mymoney/settings/production.dist`` en ``mymoney/settings/production.py`` puis l'éditer::

source: install JS libraries **first** with *Bower* (see :ref:`installation-deployment-frontend`) then collect statics files::
fr: installer les librairies JS **avant** avec *Bower* (voir :ref:`installation-deployment-frontend`) puis collecter les fichiers statiques::

source: execute the Django check command and apply fixes if needed::
fr: exécuter la commande de vérification de Django puis appliquer des corrections si besoin::

source: Set up cron tasks on server to execute the following commands:
fr: Configurer des tâches cron sur le serveur pour exécuter les commandes suivantes:

source: cloning recurring bank transactions::
fr: dupliquer les transactions bancaires récurrentes

source: cleanup tasks (only usefull with further user accounts)::
fr: tâches de nettoyages (utile uniquement avec plusieurs comptes utilisateurs)::

source: At the project root directory, the ``scripts`` directory provides bash script wrappers to execute these commands. Thus, you could create cron rules similar to something like::
fr: À la racine du projet, le répertoire ``scripts`` fourni des scripts bash pour exécuter ces commandes. Par conséquent, vous pouvez les utiliser en créant des règles cron similaire à::

source: For example, create a file in ``/etc/cron.d/clonescheduled``, and edit::
fr: Par exemple, créez un fichier à ``/etc/cron.d/clonescheduled``, puis éditez::

source: Development
fr: Développement

source: Install dependencies::
fr: Installer les dépendances::

source: copy ``mymoney/settings/local.dist`` to ``mymoney/settings/local.py`` and edit it::
fr: copiez ``mymoney/settings/local.dist`` à ``mymoney/settings/local.py`` et éditez le.

source: install `Bower`_. One way is to do it with `npm`_ globally::
fr: installer `Bower`_. Une des façon de le faire est avec `npm`_ globalement::

source: At the project root directory, run the following command to install JS libraries dependencies::
fr: À la racine du projet, exécutez la commande suivante pour installer les librairies JS requises::

source: install *gulp* globally to use it as a command line tool::
fr: installer globalement *gulp* pour l'utiliser comme outil de ligne de commande::

source: go to the project root directory and install gulp dependencies::
fr: aller dans le répertoire racine du projet et installer les dépendances de gulp::

source: once *node* packages are installed *locally* in ``./node_modules``, you should be able to execute the following gulp commands implemented in ``gulpfile.js``:
fr: une fois les paquets *node* installés *en local* dans ``./node_modules``, vous devriez pouvoir exécuter les commandes gulp suivantes implémentées dans ``gulpfile.js``:

source: *js*: concat and minify js
fr: *js*: concatène et minifie le js

source: *css*: concat and minify css
fr: *css*: concatène et minifie la css

source: To execute all commands at once, from the project root directory, just execute::
fr: Pour exécuter toutes les commandes d'un coup, à partir de la racine du projet, il suffit d'éxecuter::

source: Internationalization
fr: Internationalisation

source: copy ``mymoney/settings/l10n.dist`` to ``mymoney/settings/l10n.py`` and edit it::
fr: copiez ``mymoney/settings/l10n.dist`` à ``mymoney/settings/l10n.py`` et éditez le.

source: Further notes about some additional settings:
fr: Plusieurs remarques sur les paramètres supplémentaires:

source: ``USE_L10N_DIST``: Whether to use the minify file including translations. It imply that the translated file is generated with *gulp* (``mymoney.min.<LANGCODE>.js``). If false (default), additionnal JS translations files would be loaded.
fr: ``USE_L10N_DIST``: Faut-il ou non utiliser le fichier minifié qui inclut les traductions. Cela implique que le fichier minifié avec traductions a été généré avec *gulp* (``mymoney.min.<LANGCODE>.js``). Si c'est faux (par défaut), les fichiers JS de traductions seront chargés en plus.

source: ``BOOTSTRAP_CALENDAR_LANGCODE``: If ``USE_L10N_DIST`` is false, the language code to use to load the translation file at: ``mymoney/static/bower_components/bootstrap-calendar/js/language/<LANGCODE>.js``
fr: ``BOOTSTRAP_CALENDAR_LANGCODE``: Si ``USE_L10N_DIST`` est faux, le code langue à utiliser pour charger le fichier de traduction à: ``mymoney/static/bower_components/bootstrap-calendar/js/language/<LANGCODE>.js``

source: ``BOOTSTRAP_DATEPICKER_LANGCODE``: If ``USE_L10N_DIST`` is false, the language code to use to load the translation file at: ``mymoney/static/bower_components/bootstrap-datepicker/js/locales/bootstrap-datepicker.<LANGCODE>.js``
fr: ``BOOTSTRAP_DATEPICKER_LANGCODE``: Si ``USE_L10N_DIST`` est faux, le code langue à utiliser pour charger le fichier de traduction à: ``mymoney/static/bower_components/bootstrap-datepicker/js/locales/bootstrap-datepicker.<LANGCODE>.js``

source: edit your final setting file to use the l10n configuration instead::
fr: éditez votre fichier de configuration finale pour utiliser le fichier de configuration l10n à la place::

source: optionally build the minified JS distribution for your language. To achieve it, you first need to have *gulp* installed. See section :ref:`installation-frontend-development` for more details about *gulp*. The ``gulp js`` accept optional parameters:
fr: optionnellement, construisez le fichier JS minifié de la distribution pour votre langue. Pour y parvenir, vous devez d'abord avoir *gulp* d'installé. Voir la section :ref:`installation-frontend-development` pour plus de détails à propos de *gulp*. La commande ``gulp js`` a des paramètres optionnels:

source: ``--lang``: the IETF language code of the form : *xx-XX*. **Must** be the same as the Django ``LANGUAGE_CODE`` setting.
fr: ``--lang``: le code langue IETF de la forme : *xx-XX*. **Doit** être le même que le paramètre Django ``LANGUAGE_CODE``.

source: ``--lang_bt_cal``: the Bootstrap calendar language code to use. To see the list of available code supported, take a look at : ``mymoney/static/bower_components/bootstrap-calendar/js/language/<LANGCODE>.js``
fr: ``--lang_bt_cal``: La langue de Bootstrap calendar à utiliser. Pour connaître la liste des codes disponibles, jetez un oeil à : ``mymoney/static/bower_components/bootstrap-calendar/js/language/<LANGCODE>.js``

source: ``--lang_bt_dp``: the Bootstrap datepicker language code to use. Be careful, currently the language code must be of the form *xx* and not *xx-XX*. To see the list of available language codes, take a look at : ``mymoney/static/bower_components/bootstrap-datepicker/js/locales/bootstrap-datepicker.<LANGCODE>.js``
fr: ``--lang_bt_dp``: le code langue de Bootstrap datepicker à utiliser. Attention actuellement, le code langue est de la forme *xx* et non *xx-XX*. Pour connaître la liste des codes langues disponibles, regardez à : ``mymoney/static/bower_components/bootstrap-datepicker/js/locales/bootstrap-datepicker.<LANGCODE>.js``

source: For example, for a French minify JS file, you should execute::
fr: Par exemple pour un fichier JS minifié français, vous devriez exécuter::

source: Seems too much verbose to specify 3 arguments for languages but unfortunetly, none of them used the same...
fr: Il semble trop verbeux d'avoir 3 arguments pour la langue mais malheureusement, aucun d'entre eux n'utilisent les mêmes...

source: Only *French* internationalisation/translations are supported for now. But any contributions are welcome!
fr: Les traductions en *français* sont uniquement supportées pour le moment. Mais toutes contributions sont les bienvenues !

source: Demo
fr: Démo

source: To have a quick look, you could generate some data with the following commands::
fr: Pour un aperçu rapide, vous pouvez générer des données avec la commande suivante::

source: You can also clear any data relatives to the project's models with::
fr: Vous pouvez aussi nettoyer les données relatives aux modèles du projet avec::

source: Whichever method is used, you must create a setting file for testing. Copy ``mymoney/settings/test.dist`` to ``mymoney/settings/test.py`` and edit it::
fr: Qu'importe la méthode utilisée, vous devez créer un fichier de configuration de test. Copiez ``mymoney/settings/test.dist`` à ``mymoney/settings/test.py`` et éditez le.

source: You can use `Tox`_. At the project root directory without virtualenv, just execute::
fr: Vous pouvez utiliser `Tox`_. À la racine du projet sans virtualenv, exécutez juste::

source: Behind the scenes, it runs several *testenv* for:
fr: En coulisses, plusieurs *testenv* sont exécutés:

source: test suites with coverage and report
fr: suite de tests avec couverture et rapport

source: Manually
fr: Manuellement

source: install dependencies::
fr: installer les dépendances::

source: then execute tests::
fr: puis exécutez les tests::
