Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/schedulers.po
Languages: fr

source: Schedulers
fr: Planifications

source: Even before trying to insert some bank transaction, a better approach would be to create first bank transaction schedulers (for recurring payments for e.g).
fr: Avant même d'essayer de créer de nouvelles transactions, une meilleure approche serait de créer d'abord des planifications (pour des paiments récurrents par exemple).

source: On the page of the bank account, click on the link *Schedule* in the menu tab links. You are redirected to the scheduler overview page. On this page, you could:
fr: Sur la page du compte bancaire, cliquez sur le lien *Planifier* de l'onglet du menu. Vous êtes redirigé sur la page d'aperçu des planifications. Sur cette page, vous pouvez :

source: see a summary of periodic debit/credit
fr: voir un résumé périodique débit/crédit

source: add/edit/delete scheduler
fr: ajouter/modifier/supprimer des planifications

source: Fields
fr: Champs

source: Some fields need more explanations:
fr: Certains champs nécessitent quelques explications :

source: Period
fr: Période

source: For the moment, there are two kinds of periods:
fr: Pour le moment, il y a deux types de périodes :

source: weekly: clone bank transactions every week for a given date, depending on localization (i.e. first day of the week).
fr: hebdomadaire : duplique les transactions bancaires toutes les semaines à partir d'une date, dépendant de la localisation (premier jour de la semaine).

source: monthly: clone bank transactions every month for a given date. Don't worry, each month is properly respected : The 2015-01-29 will be 2015-02-28 for the next month.
fr: mensuelle : duplique les transactions bancaires tous les mois à partir d'une date. Pas d'inquiétude, chaque mois est correctement respecté : le 29/01/2015 deviendra le 28/02/2015 pour le mois suivant.

source: Recurrence
fr: Récurrence

source: You can specify how many time the scheduler will be repeat with the *recurrence* field. Leave it empty to be repeated indefinitely. If not infinite, when 0 is reached, the scheduler is automatically deleted.
fr: Vous pouvez spécifier combien de fois la planification sera répétée avec le champ *récurrence*. Laissez le vide pour une répétition infinie. Si elle n'est pas infinie, quand 0 est atteint, la planificiation sera automatiquement supprimée.

source: The *date* is used to be repeated for the next corresponding period. For example, if you have a rent every 10 of the month, you should write a date where day is 10, and month is the **current** month (not the next month), even if the current day is 26 for example.
fr: La *date* est utilisée comme base pour les répétitions. Par exemple, si vous avez un loyer tous les 10 du mois, vous devriez saisir une date au 10 pour le mois courant (pas le mois suivant), même si le jour courant est le 26 par exemple.

source: Keep in mind that when the background task (cron) would try to clone a bank transaction, it will create it for the **next** date.
fr: Gardez à l'esprit que lorsque la tâche de fond (cron) essaye de dupliquer les transactions bancaires, ce sera pour la date **suivante**.

source: Start now
fr: Commencer maintenant
