Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/statistics.po
Languages: fr

source: Statistics
fr: Statistiques

source: You can check statistics for a given bank account. To do so, go on the bank account page and click on the menu tab item *Statistics*. You can then switch between two view modes:
fr: Vous pouvez visualiser les statistiques d'un compte bancaire. Pour cela, allez sur la page du compte bancaire et cliquez sur le lien du menu *Statistiques*. Vous pouvez ensuite basculer entre deux types de vues :

source: ratio report: based on tags
fr: rapport proportionnel: basés sur les étiquettes

source: trendtime report: based on dates
fr: rapport chronologique: basés sur les dates

source: Each report provides some basic filters and a quick summary. Each summary has more details when you click on a targeted item.
fr: Chaques rapports fournissent des filtres et un résumé. Chaques résumés ont plus de détails quand vous cliquez sur l'un de ces éléments.

source: Ratio
fr: Proportionnel

source: Filter type: sum or single
fr: Filtre type: somme ou unitaire

source: Ratio statistics display results grouped by tags. To have relevant percentage, numbers compared must be of the same sign (positive or negative). That's why there is two *sub-types*:
fr: Les statistiques proportionnelles affichent des résultats groupés par étiquettes. Afin d'obtenir des pourcentages pertinents, les nombres comparés doivent être du même signe (positif ou négatif). C'est pourquoi il existe deux sous-types :

source: expenses
fr: dépenses

source: wages
fr: revenus

source: For an expense search with *single* mode, **each negative bank transactions** are used. For an expenses search with *sum* mode, **each negative sum** of tags are used.
fr: Pour une recherche de dépenses en mode unitaire, **chaques transactions bancaires négatives** sont utilisées. Pour une recherche de dépenses en mode *somme*, **chaques sommes négatives** d'étiquettes sont utilisées.

source: For example, imagine you do some shopping for $100. Unfortunetely, you discover that an item isn't good. You return it and get a refund of $25. With *single* type filter, the amount used would be -$100. Whereas with *sum* type filter, the amount used would be -100 + 25 = -$75.Par exemple, imaginez que vous avez fait du shopping pour 100€. Malheureusement, vous découvrez qu'un bien n'est pas bon. Vous le retourné et vous êtes remboursé de 25€. Avec le filtre type *unitaire*, le montant utilisé sera 100€. Alors qu'avec le filtre type *somme*, le montant utilisé sera de -100 + 25 = 75€.
fr: La plupart du temps, le mode le plus désiré sera *somme*, c'est pourquoi c'est le mode par défaut.
