Repository: FeodorOtt/mymoney
Catalog: docs/locale/*/LC_MESSAGES/users.po
Languages: fr

source: Users
fr: Utilisateurs

source: Create a basic user
fr: Création d'un utilisateur basique

source: To don't mix superuser and basic user permissions, you will need to create and use **only** a *basic* user. Otherwise, if you use the superuser account on front-office and try to create a bank account, you won't see your own account in the owner list.
fr: Afin de ne pas mélanger les permissions utilisateur d'un compte basique et d'un compte super utilisateur, vous devez créer et utiliser **uniquement** un compte utilisateur *basique*. Sinon, si vous utilisez un compte super utilisateur en front-office et que vous essayez de créer un compte bancaire, vous ne pourrez pas voir votre propre compte dans la liste des propriétaires.

source: This is intentional : a basic user cannot add super user or staff user as an owner of a bank account.
fr: C'est intentionnel: un utilisateur basique ne peut pas ajouter un super utilisateur ou un membre de l'équipe comme propriétaire du compte bancaire.

source: create the superuser if not already::
fr: créez un super utilisateur si ca n'est pas déjà fait::

source: connect to the Django backoffice in order to create a user account.
fr: connectez-vous au back-office de Django afin de créer un compte utilisateur

source: Don't forget to assign any permissions required (i.e: beginning with *bank*).
fr: N'oubliez pas d'assigner les permissions requises (commençant par *bank*).

source: Each permissions are derived from the default Django model (add, change, delete). However, here is additional permissions:
fr: Chaque permissions sont hérités du modèle par défaut de Django (ajouter, changer, supprimer). Cependant, voici des permissions supplémentaires :

source: administer owners: allow user to manager owners of a bank account
fr: administer owners: autorise un utilisateur à administrer les propriétaires de ces compte bancaires

source: Anonymous user
fr: Utilisateur anonyme

source: Because being authenticated is required, an anonymous user could **only** access the ``/login`` url (``LOGIN_URL``) or back-office (``ADMIN_BASE_URL``). Any attempt as an anonymous user to access an another url would redirect to the login page.
fr: Parce que l'authentification est requise, un utilisateur anonyme peut **uniquement** accéder aux urls ``/login`` (``LOGIN_URL``) et au back-office (``ADMIN_BASE_URL``). Toutes tentatives d'accès à d'autres urls en tant qu'utilisateur anonyme seront redirigées sur la page de connexion.
